package ru.ostrov77.factions.religy;

import java.util.Arrays;
import java.util.List;

    
    public enum Religy {

        
        Нет         (0, null ), 
        
        Первобытность   (1, Arrays.asList(
                "§b«ДИКОСТЬ»", 
                "§2Сырая еда насыщает больше",    //+
                "",
                "§b«НЕОБРАЗОВАННОСТЬ»",    //+
                "§6Чары - непостижимая наука", 
                "",
                "§b«ПРИМИТИВНОСТЬ»",
                "§4Порталы невозможно использовать"    //+
        ) ), 
        
        Мифология   (2, Arrays.asList(
                "§b«ДУША ОЛИМПА»", 
                "§2Ускорение добычи ресурсов",  //+
                "",
                "§b«КОЛЕСО ФОРТУНЫ»", 
                "§6Каждый цыкл удача может", 
                "§6придти. Или удти.", 
                "",
                "§b«АХИЛЕСОВА ПЯТА»",    //+
                "§4Двойной урон при падении"
        ) ), 
        
        Ислам       (3, Arrays.asList(
                "§b«ВОСТОЧНЫЙ ВОИН»", 
                "§2Неуязвимость к огню",     //+
                "",
                "§b«ТРАДИЦИОННЫЕ ЦЕННОСТИ»", 
                "§6Запрещено поедание плоти", //+
                "",
                "§b«ВРОЖДЕННАЯ СЛАБОСТЬ»", 
                "§4Урон с топора понижен"    //+
        ) ), 
        
        Буддизм     (4, Arrays.asList(
                "§b«ВЕЛИКАЯ МУДРОСТЬ»", 
                "§2Животные всегда повинуются вам",     //+
                "§2и становятся сильнее с вами",
				"",
                "§b«ГРЕХ ЧРЕВОУГОДИЯ»",     
                "§6Сытость тратится в раза быстрее",  //+
                "",
                "§b«ЗАПРЕТ НА ПЛОТЬ»", 
                "§4Полное вегетерианство",    //+
                "§4мясо дает голод."    //+
        ) ), 
       
        Христианство(5, Arrays.asList(
                "§b«КАРА НЕБЕС»",
                "§2На месте смерти появиться дух...",      //+
                "",
                "§b«ПОСЛЕДОВАТЕЛЬ ХРИСТА»", 
                "§6Постоянный эффект свечения",  //+
                "",
                "§b«ДЕСЯТИНА»",
                "§4Берется налог из казны"    //+
        ) ), 
        
        Атеизм      (6, Arrays.asList(
                "§b«ИММАТЕРИАЛИЗМ»", 
                "§23 дополнительных сердца",     //+
                "",
                "§b«ВОСПРИЯТИЕ»",
                "§6Все зелья имеют больший эффект",     //+
                "",
                "§b«БЕЗБОЖНИК»",
                "§4Слепота при убийстве верующего"    //+
        ) ),
        ;
        
        
        
        public final int order;
        public final List<String> desc;
        
        private Religy (final int order, final List<String> desc) {
            this.order = order;
            this.desc = desc;
        }
        public static Religy fromCode(final int order) {
//System.out.println("==================Religy.fromCode() "+order+" len="+Religy.values().length+" []="+Religy.values()[order]);
            if (order>=Religy.values().length) return Нет;
            return Religy.values()[order];
        }
    }
    
    